grevaillot/svd_tools/headers/STM32H750x/gpiog.h
/** @defgroup gpiog_gpio_lckr GPIOLCKR This register is used to lock the configuration of the port bits when a correct write sequence is applied to bit 16 (LCKK). The value of bits [15:0] is used to lock the configuration of the GPIO. During the write sequence, the value of LCKR[15:0] must not change. When the LOCK sequence has been applied on a port bit, the value of this port bit can no longer be modified until the next MCU reset or peripheral reset.A specific write sequence is used to write to the GPIOx_LCKR register. Only word access (32-bit long) is allowed during this locking sequence.Each lock bit freezes a specific configuration register (control and alternate function registers).
@{*/

/** GPIOG_GPIO_LCKR_LCKK Lock key This bit can be read any time. It can only be modified using the lock key write sequence. LOCK key write sequence: WR LCKR[16] = 1 + LCKR[15:0] WR LCKR[16] = 0 + LCKR[15:0] WR LCKR[16] = 1 + LCKR[15:0] RD LCKR RD LCKR[16] = 1 (this read operation is optional but it confirms that the lock is active) Note: During the LOCK key write sequence, the value of LCK[15:0] must not change. Any error in the lock sequence aborts the lock. After the first lock sequence on any bit of the port, any read access on the LCKK bit will return 1 until the next MCU reset or peripheral reset. **/
#define GPIOG_GPIO_LCKR_LCKK		(1 << 16)
/** GPIOG_GPIO_LCKR_LCK15 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK15		(1 << 15)
/** GPIOG_GPIO_LCKR_LCK14 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK14		(1 << 14)
/** GPIOG_GPIO_LCKR_LCK13 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK13		(1 << 13)
/** GPIOG_GPIO_LCKR_LCK12 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK12		(1 << 12)
/** GPIOG_GPIO_LCKR_LCK11 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK11		(1 << 11)
/** GPIOG_GPIO_LCKR_LCK10 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK10		(1 << 10)
/** GPIOG_GPIO_LCKR_LCK9 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK9		(1 << 9)
/** GPIOG_GPIO_LCKR_LCK8 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK8		(1 << 8)
/** GPIOG_GPIO_LCKR_LCK7 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK7		(1 << 7)
/** GPIOG_GPIO_LCKR_LCK6 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK6		(1 << 6)
/** GPIOG_GPIO_LCKR_LCK5 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK5		(1 << 5)
/** GPIOG_GPIO_LCKR_LCK4 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK4		(1 << 4)
/** GPIOG_GPIO_LCKR_LCK3 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK3		(1 << 3)
/** GPIOG_GPIO_LCKR_LCK2 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK2		(1 << 2)
/** GPIOG_GPIO_LCKR_LCK1 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK1		(1 << 1)
/** GPIOG_GPIO_LCKR_LCK0 Port x lock bit y (y= 0..15) These bits are read/write but can only be written when the LCKK bit is 0. **/
#define GPIOG_GPIO_LCKR_LCK0		(1 << 0)

/**@}*/

/** @defgroup gpiog_gpio_afrl GPIOAFRL GPIO alternate function low register
@{*/


#define GPIOG_GPIO_AFRL_AFSEL7_SHIFT		28
#define GPIOG_GPIO_AFRL_AFSEL7_MASK		0x0f
/** @defgroup gpiog_gpio_afrl_afsel7 AFSEL7 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOG_GPIO_AFRL_AFSEL6_SHIFT		24
#define GPIOG_GPIO_AFRL_AFSEL6_MASK		0x0f
/** @defgroup gpiog_gpio_afrl_afsel6 AFSEL6 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOG_GPIO_AFRL_AFSEL5_SHIFT		20
#define GPIOG_GPIO_AFRL_AFSEL5_MASK		0x0f
/** @defgroup gpiog_gpio_afrl_afsel5 AFSEL5 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOG_GPIO_AFRL_AFSEL4_SHIFT		16
#define GPIOG_GPIO_AFRL_AFSEL4_MASK		0x0f
/** @defgroup gpiog_gpio_afrl_afsel4 AFSEL4 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOG_GPIO_AFRL_AFSEL3_SHIFT		12
#define GPIOG_GPIO_AFRL_AFSEL3_MASK		0x0f
/** @defgroup gpiog_gpio_afrl_afsel3 AFSEL3 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOG_GPIO_AFRL_AFSEL2_SHIFT		8
#define GPIOG_GPIO_AFRL_AFSEL2_MASK		0x0f
/** @defgroup gpiog_gpio_afrl_afsel2 AFSEL2 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOG_GPIO_AFRL_AFSEL1_SHIFT		4
#define GPIOG_GPIO_AFRL_AFSEL1_MASK		0x0f
/** @defgroup gpiog_gpio_afrl_afsel1 AFSEL1 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


#define GPIOG_GPIO_AFRL_AFSEL0_SHIFT		0
#define GPIOG_GPIO_AFRL_AFSEL0_MASK		0x0f
/** @defgroup gpiog_gpio_afrl_afsel0 AFSEL0 [3:0]: Alternate function selection for port x pin y (y = 0..7) These bits are written by software to configure alternate function I/Os AFSELy selection:
@{*/
/**@}*/


/**@}*/

/** @defgroup gpiog_gpio_afrh GPIOAFRH GPIO alternate function high register
@{*/


#define GPIOG_GPIO_AFRH_AFSEL15_SHIFT		28
#define GPIOG_GPIO_AFRH_AFSEL15_MASK		0x0f
/** @defgroup gpiog_gpio_afrh_afsel15 AFSEL15 [3:0]: Alternate function selection for port x pin y (y = 8..15) These bits are written by software to configure alternate function I/Os
@{*/
/**@}*/


